### Import required dependencies

In [1]:
import pandas as pd
import os

## Deliverable 1: Collect the Data

To collect the data that youâ€™ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [2]:
# Create the path and import the data
full_student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [3]:
# Verify that the data was properly imported
print (student_df)

       student_id      student_name grade             school_name  \
0       103880842     Travis Martin   9th    Sullivan High School
1        45069750     Michael Brown   9th       Dixon High School
2        45024902   Gabriela Lucero   9th      Wagner High School
3        62582498  Susan Richardson   9th       Silva High School
4        16437227      Sherry Davis  11th      Bowers High School
...           ...               ...   ...                     ...
19509   109236636     Robert Sawyer  12th       Silva High School
19510    63239258      David Herman   9th       Woods High School
19511    95516554        Megan Gill  11th      Wagner High School
19512    65050383        Lori Stone  11th      Bowers High School
19513    34720657       Anna Jensen  12th  Montgomery High School

       reading_score  math_score school_type  school_budget
0               59.0        88.2      Public         961125
1               94.7        73.5     Charter         870334
2               89.0        70.4      Public         846745
3               69.7        80.3      Public         991918
4                NaN        27.5      Public         848324
...              ...         ...         ...            ...
19509           43.3        27.2      Public         991918
19510           52.1        80.4      Public         912243
19511           93.9        84.1      Public         846745
19512           94.6        70.9      Public         848324
19513           82.3        42.4     Charter         893368

[19514 rows x 8 columns]

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [4]:
# Check for null values
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [5]:
# Drop rows with null values and verify removal
student_df = student_df.dropna()
student_df.isnull().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [6]:
# Check for duplicated rows
student_df.duplicated().sum()

1836

In [7]:
# Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [8]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [9]:
# Examine the grade column to understand why it is not an int
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [10]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [11]:
# Change the grade column to the int type and verify column types
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [12]:
# Display summary statistics for the DataFrame

student_df.describe(include='all')

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
count,1.483100e+04,14831,14831.000000,14831,14831.000000,14831.000000,14831,14831.000000
unique,NaN,13461,NaN,15,NaN,NaN,2,NaN
top,NaN,Michael Davis,NaN,Montgomery High School,NaN,NaN,Public,NaN
freq,NaN,7,NaN,2038,NaN,NaN,8120,NaN
mean,6.975296e+07,NaN,10.355539,NaN,72.357865,64.675733,NaN,893742.749107
std,3.452909e+07,NaN,1.097728,NaN,15.224590,15.844093,NaN,53938.066467
min,1.000906e+07,NaN,9.000000,NaN,10.500000,3.700000,NaN,817615.000000
25%,3.984433e+07,NaN,9.000000,NaN,62.200000,54.500000,NaN,846745.000000
50%,6.965978e+07,NaN,10.000000,NaN,73.800000,65.300000,NaN,893368.000000
75%,9.927449e+07,NaN,11.000000,NaN,84.000000,76.000000,NaN,956438.000000
max,1.299997e+08,NaN,12.000000,NaN,100.000000,100.000000,NaN,991918.000000

In [13]:
# Display the mean math score using the mean function
mean_math_score = student_df['math_score'].mean()
mean_math_score

64.67573326141189

In [14]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df['reading_score'].min()

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [15]:
# Use loc to display the grade column
student_df.loc[:,'grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [16]:
#Use 'iloc' to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[:, [2, 3, 4]].head(3)

   grade           school_name  reading_score
0      9  Sullivan High School           59.0
1      9     Dixon High School           94.7
2      9    Wagner High School           89.0

In [17]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
student_df.loc[student_df['grade'] -- 9].describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   9.355457e+07     10.278606      70.874506     61.107916  859535.276313
std    2.927624e+07      0.448328       4.916472     16.399298   51250.624914
min    6.296279e+07     10.000000      64.300000     48.100000  832670.000000
25%    6.296279e+07     10.000000      68.200000     48.100000  832670.000000
50%    6.827250e+07     10.000000      71.600000     52.200000  832670.000000
75%    1.271472e+08     11.000000      77.500000     60.300000  832670.000000
max    1.271472e+08     11.000000      77.500000     91.300000  957299.000000

In [18]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_row = student_df.loc[student_df['reading_score'] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [19]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
print(student_df.loc[(student_df['grade'] == 10) & (student_df['school_name'] == 'Dixon High School'), 'reading_score'])

45       71.1
60       59.5
69       88.6
94       81.5
100      95.3
         ...
19283    52.9
19306    58.0
19344    38.0
19368    84.4
19445    43.9
Name: reading_score, Length: 569, dtype: float64

In [20]:
# Find the mean reading score for all students in grades 11 and 12 combined.
print(student_df.loc[(student_df['grade'] >= 11), 'reading_score'].mean())

74.90038089192188

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [21]:
# Use groupby and mean to find the average reading and math scores for each school type.
school_type_math = student_df.groupby(["school_type"]).mean()["math_score"]

school_type_math

school_type
Charter    66.761883
Public     62.951576
Name: math_score, dtype: float64

In [22]:
school_type_reading = student_df.groupby(["school_type"]).mean()["reading_score"]
school_type_reading

school_type
Charter    72.450603
Public     72.281219
Name: reading_score, dtype: float64

In [23]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.

In [24]:
total_number_student_df=student_df[["school_name", "student_id"]].groupby(by="school_name").count()
total_number_student_df.rename(columns={"student_id":"student_count"}).sort_values("student_count", ascending=False)

                        student_count
school_name
Montgomery High School           2038
Green High School                1961
Dixon High School                1583
Wagner High School               1541
Silva High School                1109
Woods High School                1052
Sullivan High School              971
Turner High School                846
Bowers High School                803
Fisher High School                798
Richard High School               551
Campos High School                541
Odonnell High School              459
Campbell High School              407
Chang High School                 171

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

*your summary here*

In [25]:
# Over the course of this challenge